import React, { useState } from "react";
import { direction } from "../images";
const CollapsibleBox = ({ title, content }) => {
  const [isOpen, setIsOpen] = useState(false);

  return (
    <div className="border rounded-lg mb-4 ">
   <div className="flex items-center justify-between">
   <button
        onClick={() => setIsOpen(!isOpen)}
        className="w-full text-right    p-4 bg-gray-100 hover:bg-gray-200 focus:outline-none"
      >
        {title}
        <img  className="  text-left " src={direction} alt="" />
      </button>

   </div>
      {isOpen && (
        <div className="p-4">
          {content}

          <button className="mt-2 px-4 py-2 bg-red-500 text-white rounded-lg">
            دانلود کاتالوگ محصول
          </button>
        </div>
      )}
    </div>
  );
};

const MainSelectBox = () => {
  return (
    <div className="max-full  mx-auto p-8">
      {/* <div className="border p-4 mb-4">
        <h2 className="text-xl font-bold mb-2">کارت هوشمند</h2>
        <p>
          لورم ایپسوم متن ساختگی از صنعت چاپ، و با استفاده از طراحان گرافیک
          است...
        </p>
        <button className="mt-2 px-4 py-2 bg-red-500 text-white rounded-lg">
          دانلود کاتالوگ محصول
        </button>
      </div> */}

      <CollapsibleBox
        title=" کارت هوشمند   "
        content={
          <p
            className="text-12   leading-normal
          "
          >
            لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با
            استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در
            ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز،
            و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای
            زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و
            متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان
            رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد
            کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه
            راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل
            حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود
            طراحی اساسا مورد استفاده قرار گیرد.
          </p>
        }
      />

      <CollapsibleBox
        title="توکن سخت افزاری"
        content={
          <p
            className="text-12  leading-normal
          "
          >
            {" "}
            لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با
            استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در
            ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز،
            و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای
            زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و
            متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان
            رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد
            کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه
            راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل
            حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود
            طراحی اساسا مورد استفاده قرار گیرد.
          </p>
        }
      />
      <CollapsibleBox
        title="ماژول امنیتی سخت افزاری"
        content={
          <p
            className="text-12  leading-normal
          "
          >
            {" "}
            لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با
            استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در
            ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز،
            و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای
            زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و
            متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان
            رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد
            کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه
            راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل
            حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود
            طراحی اساسا مورد استفاده قرار گیرد.
          </p>
        }
      />
    </div>
  );
};

export default MainSelectBox;
