import React from 'react'
import Navbar from "../components/Navbar";
import Header from "../components/Header";
import ProductCard from "../components/ProductCard";


import Footer from "../components/Footer";
import {blogpic,user} from '../images'
const WebLog = () => {
  return (
    <>
     
  <Navbar />
    <Header />
   

         <div className="parent-tag bg-white px-24 mb-48 mt-6">
      <div className="first-child flex gap-12 items-center justify-center container m-auto">
        <img src={blogpic} alt="" />
        
        <div className="text-box ">
          <div className="title w-[544px] h-12 text-mygray   ml-14  text-10"> 
   <div className='flex items-center gap-2'>
   <img src={user} alt="" />
       <span>   نام و نام خانوادگی نویسنده  </span>  

   </div>
              </div>
          <div className=" text-mygray mt-3 text-sm md:text-18  ">
          خطی که مهمتر است را می‌توان در این قسمت نوشت
           </div>
        </div>
   
      </div>
      <div className=' flex  items-center mx-72 mt-8'>
    <p className=' text-myblue text-16'>موضوع مقاله اینجا نوشته شود</p>
  </div>
  <div className=' flex  items-center mx-72 mt-8'>
        <p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
            
        </p>
    </div>
  <div className=' flex  items-center mx-72 mt-8'>
        <p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
            
        </p>
    </div>
  <div className=' flex  items-center mx-72 mt-8'>
        <p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
            
        </p>
    </div>
  </div>
  <ProductCard/>
  <Footer/>  
    </>
  )
}

export default WebLog
